kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WebSocketsServer.h>
#include <Hash.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#if WIFI_MANAGER
#include <WiFiManager.h>
#endif /* WIFI_MANAGER */
#include <ESP8266HTTPUpdateServer.h>

#include "storage.h"
#include "handset.h"
#include "main.h"
#include "stm32_ota.h"
#include "stm32Updater.h"
#include "stk500.h"
#include "msp.h"
#include "common_defs.h"
#include "rc_channels.h"
#include "html_default.h"
#include "led.h"
#include "comm_espnow.h"


#ifndef SERIAL_BAUD
#define SERIAL_BAUD 460800
#endif

#define STRINGIFY(s) #s
#define STRINGIFY_TMP(A) STRINGIFY(A)
#define CONCAT(A, B) A##B

//#define INVERTED_SERIAL // Comment this out for non-inverted serial

#ifndef WIFI_AP_SSID
#define WIFI_AP_SSID "ExpressLRS AP"
#endif
#ifndef WIFI_AP_PSK
#define WIFI_AP_PSK "expresslrs"
#endif

#if CONFIG_HANDSET
#define WIFI_AP_SUFFIX " HANDSET"
#else
#define WIFI_AP_SUFFIX " MODULE"
#endif

#ifndef WIFI_TIMEOUT
#define WIFI_TIMEOUT 60 // default to 1min
#endif


MDNSResponder mdns;

ESP8266WebServer server(80);

WebSocketsServer webSocket = WebSocketsServer(81);
ESP8266HTTPUpdateServer httpUpdater;

String inputString = "";
String my_ipaddress_info_str = "NA";

#if CONFIG_HANDSET
/* Handset specific data */
struct gimbal_limit gimbals[TX_NUM_ANALOGS];
struct mixer mixer[TX_NUM_MIXER];
static uint8_t handset_num_switches, handset_num_aux;
static uint8_t handset_mixer_ok = 0, handset_adjust_ok = 0;
#endif

/*************************************************************************/

void beep(int note, int duration, int wait=1)
{
#ifdef BUZZER_PIN
#if BUZZER_PASSIVE
  tone(BUZZER_PIN, note, duration);
  if (wait)
    delay(duration);
#else // BUZZER_ACTIVE
  digitalWrite(BUZZER_PIN, HIGH);
  delay(duration);
  digitalWrite(BUZZER_PIN, LOW);
#endif /* BUZZER_PASSIVE */
#else /* !BUZZER_PIN */
  (void)note, (void)duration, (void)wait;
#endif /* BUZZER_PIN */
}

/*************************************************************************/

class CtrlSerialPrivate: public CtrlSerial
{
public:
  size_t available(void) {
    return Serial.available();
  }
  uint8_t read(void) {
    return Serial.read();
  }

  void write(uint8_t * buffer, size_t size) {
    Serial.write(buffer, size);
  }
};

CtrlSerialPrivate my_ctrl_serial;
CtrlSerial& ctrl_serial = my_ctrl_serial;

static uint8_t settings_rate;
static uint8_t settings_power, settings_power_max;
static uint8_t settings_tlm;
static uint8_t settings_region;
static uint8_t settings_valid;

MSP msp_handler;
mspPacket_t msp_out;

void SettingsWrite(uint8_t * buff, uint8_t len)
{
  // Fill MSP packet
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.payloadSize = len;
  msp_out.function = ELRS_INT_MSP_PARAMS;
  memcpy((void*)msp_out.payload, buff, len);
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleSettingRate(const char * input, int num = -1)
{
  String settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_rates_input=";
    settings_out += settings_rate;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting rate: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {1, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  websocket_send(settings_out, num);
}

void handleSettingPower(const char * input, int num = -1)
{
  String settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_power_input=";
    settings_out += settings_power;
    settings_out += ",";
    settings_out += settings_power_max;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting power: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {3, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  websocket_send(settings_out, num);
}

void handleSettingTlm(const char * input, int num = -1)
{
  String settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_tlm_input=";
    settings_out += settings_tlm;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting telemetry: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    uint8_t buff[] = {2, (uint8_t)(val == 'R' ? 0xff : (val - '0'))};
    SettingsWrite(buff, sizeof(buff));
  }
  websocket_send(settings_out, num);
}

void handleSettingRfPwr(const char * input, int num = -1)
{
  String settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    return;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting RF PWR: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    if ('A' <= val)
      val = 10 + (val - 'A');
    else
      val = (val - '0');
    uint8_t buff[] = {6, (uint8_t)val};
    SettingsWrite(buff, sizeof(buff));
  }
  websocket_send(settings_out, num);
}

void handleSettingRfModule(const char * input, int num = -1)
{
  String settings_out = "[INTERNAL ERROR] something went wrong";
  if (input == NULL || *input == '?') {
    return;
  } else if (*input == '=') {
    input++;
    settings_out = "Setting RF module: ";
    settings_out += input;
    // Write to ELRS
    char val = *input;
    if ('A' <= val)
      val = 10 + (val - 'A');
    else
      val = (val - '0');
    uint8_t buff[] = {4, (uint8_t)val};
    SettingsWrite(buff, sizeof(buff));
  }
  websocket_send(settings_out, num);
}

void handleSettingDomain(const char * input, int num = -1)
{
  String settings_out = "[ERROR] Domain set is not supported!";
  if (input == NULL || *input == '?') {
    settings_out = "ELRS_setting_region_domain=";
    settings_out += settings_region;
  }
  websocket_send(settings_out, num);
}

void SettingsGet(uint8_t wsnum)
{
  if (!settings_valid) {
    /* Unknown... reguest update */
    uint8_t buff[] = {0, 0};
    SettingsWrite(buff, sizeof(buff));
  } else {
    /* Valid, just send those to client */
    delay(5);
    handleSettingDomain(NULL, wsnum);
    delay(5);
    handleSettingRate(NULL, wsnum);
    delay(5);
    handleSettingPower(NULL, wsnum);
    delay(5);
    handleSettingTlm(NULL, wsnum);
  }
}

void MspVtxWrite(const char * input, int num = -1)
{
  (void)num;
  (void)input;
  //uint8_t power = 1;
  uint16_t freq = 5840; //(uint16_t)msg[0] * 8 + msg[1]; // band * 8 + channel

  if (input[0] == '=') {
    freq = (input[1] - '0');
    freq = freq*10 + (input[2] - '0');
    freq = freq*10 + (input[3] - '0');
    freq = freq*10 + (input[4] - '0');
  }

  uint8_t vtx_cmd[] = {
    (uint8_t)freq, (uint8_t)(freq >> 8),
    //power,
    //(power == 0), // pit mode
  };

