kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
void battery_voltage_parse(const char * input, int num = -1)
{
  const char * temp = strstr(input, ",");
  uint32_t scale = char_u8_to_hex(input);
  if (50 <= scale && scale <= 150) {
    eeprom_storage.batt_voltage_scale = scale;
    eeprom_storage.markDirty();
  }
  if (temp) {
    scale = char_u8_to_hex(&temp[1]);
    if (10 <= scale && scale <= 100) {
      eeprom_storage.batt_voltage_warning = scale;
      eeprom_storage.markDirty();

      batt_voltage_warning_limit = ((scale * BATT_NOMINAL_mV) / 100);
    }
  }
}

void batt_voltage_init(void)
{
  batt_voltage_warning_limit =
    ((eeprom_storage.batt_voltage_warning * BATT_NOMINAL_mV) / 100);
  batt_voltage_dead_limit =
    ((BATT_DEAD_DEFAULT * BATT_NOMINAL_mV) / 100);
}

void batt_voltage_measure(void)
{
  uint32_t ms = millis();
  if (eeprom_storage.batt_voltage_interval <= (uint32_t)(ms - batt_voltage_meas_last_ms)) {
    int adc = analogRead(A0);
    batt_voltage = ADC_VOLT(adc);
    batt_voltage = (batt_voltage * eeprom_storage.batt_voltage_scale) / 100;

    battery_voltage_report();

    uint32_t brightness = (batt_voltage * 255) / BATT_NOMINAL_mV;
    if (255 < brightness) {
      batt_voltage_warning_timeout = 5000;
      brightness = 255;
    } else if (batt_voltage <= batt_voltage_dead_limit) {
      batt_voltage_warning_timeout = 500;
      brightness = 0;
    } else if (batt_voltage <= batt_voltage_warning_limit) {
      batt_voltage_warning_timeout = 500 +
        5 * (int32_t)(batt_voltage - batt_voltage_warning_limit);
      if ((int32_t)batt_voltage_warning_timeout < 500) {
        batt_voltage_warning_timeout = 500;
      }
    }

    led_brightness_set(brightness);

    batt_voltage_meas_last_ms = ms;
  }

  if ((batt_voltage <= batt_voltage_warning_limit) &&
      (batt_voltage_warning_timeout <= (ms - batt_voltage_warning_last_ms))) {
#ifdef WS2812_PIN
    if (!batt_voltage_last_bright) {
      batt_voltage_last_bright = led_brightness_get();
      led_brightness_set(0, 1);
    } else {
      led_brightness_set(batt_voltage_last_bright);
      led_set();
      batt_voltage_last_bright = 0;
    }
#endif
    // 400Hz, 20ms
    beep(400, 20, 0);

    batt_voltage_warning_last_ms = ms;
  }
}

#else
#define batt_voltage_init()
#define batt_voltage_measure()
#endif

void websocket_send(char const * data, int num)
{
  if (0 <= num)
    webSocket.sendTXT(num, data);
  else
    webSocket.broadcastTXT(data);
}

void websocket_send(String & data, int num)
{
  if (!data.length())
    return;
  websocket_send(data.c_str(), num);
}

void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;

  switch (type)
  {
  case WStype_DISCONNECTED:
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    //socketNumber = num;

    websocket_send(my_ipaddress_info_str, num);
    websocket_send(espnow_get_info(), num);

    // Send settings
    SettingsGet(num);
#if CONFIG_HANDSET
    HandsetConfigGet(num);
    delay(5);
    battery_voltage_report(num);
#endif
    break;
  }
  case WStype_TEXT:

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {

#if CONFIG_HANDSET
      /* Handset specific */
      temp = strstr((char*)payload, "handset_");
      if (temp) {

        // handset_mixer=
        temp = strstr((char*)payload, "mixer=");
        if (temp) {
          temp = &temp[6];
          handleHandsetMixer(temp, (length - ((uintptr_t)temp - (uintptr_t)payload)));
          break;
        }

        // handset_calibrate=
        temp = strstr((char*)payload, "calibrate=");
        if (temp) {
          handleHandsetCalibrate(&temp[10]);
          break;
        }

        // handset_adjust_[axe]_[min|max]=val
        temp = strstr((char*)payload, "_adjust_");
        if (temp) {
          handleHandsetAdjust(&temp[8]);
          break;
        }

        temp = strstr((char*)payload, "_refresh");
        if (temp) {
          HandsetConfigGet(num, 1);
          break;
        }

        temp = strstr((char*)payload, "_save");
        if (temp) {
          HandsetConfigSave(num);
          break;
        }

        temp = strstr((char*)payload, "_battery_config=");
        if (temp) {
          battery_voltage_parse(&temp[16], num);
          break;
        }
      } else
#endif // CONFIG_HANDSET

      {
        // ExLRS setting commands
        temp = strstr((char*)payload, "S_rate");
        if (temp) {
          handleSettingRate(&temp[6], num);
          break;
        }
        temp = strstr((char*)payload, "S_power");
        if (temp) {
          handleSettingPower(&temp[7], num);
          break;
        }
        temp = strstr((char*)payload, "S_telemetry");
        if (temp) {
          handleSettingTlm(&temp[11], num);
          break;
        }
        temp = strstr((char*)payload, "S_vtx_freq");
        if (temp) {
          MspVtxWrite(&temp[10], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_pwr");
        if (temp) {
          handleSettingRfPwr(&temp[8], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_module");
        if (temp) {
          handleSettingRfModule(&temp[11], num);
          break;
        }
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    break;
  }
}


/***********************************************************************************/
/*************                    ESP OTA UPGRADE                      *************/
#define LOCAL_OTA 0
#if LOCAL_OTA
void handle_upgrade_error(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
    websocket_send(
      (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
}

