kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
void handleEspUpgrade(void)
{
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    //Serial.setDebugOutput(true);
    WiFiUDP::stopAll();
    //Serial.printf("Update: %s\n", upload.filename.c_str());
    websocket_send("*** ESP OTA ***\n  file: " + upload.filename);

    /*if (upload.name != "backpack_fw") {
      websocket_send("Invalid upload type!");
      return;
    } else*/ if (!upload.filename.startsWith("backpack.bin")) {
      websocket_send("Invalid file! Update aborted...");
      handle_upgrade_error();
      return;
    }

    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) { //start with max available size
      //Update.printError(Serial);
      websocket_send("File is too big!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      //Update.printError(Serial);
      websocket_send("Junk write failed!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) { //true to set the size to the current progress
      //Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      websocket_send("Update Success! Rebooting...");
    } else {
      //Update.printError(Serial);
      websocket_send("Update failed!");
    }
    //Serial.setDebugOutput(false);
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
  }
  delay(0); //same as yield();
}

void handleEspUpgradeFinalize(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  websocket_send(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
  //server.sendHeader("Connection", "close");
  //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
  ESP.restart();
}
#endif // LOCAL_OTA

/***********************************************************************************/

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handle_recover()
{
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleMacAddress()
{
  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += wifi_get_channel();
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

void handle_fs(void)
{
  FSInfo fs_info;
  FILESYSTEM.info(fs_info);
  String message = "FS ino: used ";
  message += fs_info.usedBytes;
  message += "/";
  message += fs_info.totalBytes;
  message += "\n**** FS files ****\n";

  Dir dir = FILESYSTEM.openDir("/");
  while (dir.next()) {
      message += dir.fileName();
      if(dir.fileSize()) {
          File f = dir.openFile("r");
          message += " - ";
          message += f.size();
          message += "B";
      }
      message += "\n";
  }

  server.send(200, "text/plain", message);
}

String getContentType(String filename)
{
  if(filename.endsWith(".html"))
    return "text/html";
  else if(filename.endsWith(".css"))
    return "text/css";
  else if(filename.endsWith(".js"))
    return "application/javascript";
  else if(filename.endsWith(".ico"))
    return "image/x-icon";
  else if(filename.endsWith(".gz"))
    return "application/x-gzip";
  return "text/plain";
}

bool handleFileRead(String path)
{
  if (path.endsWith("/"))
    // Send the index file if a folder is requested
    path += "index.html";
  // Get the MIME type
  String contentType = getContentType(path);
  uint8_t pathWithGz = FILESYSTEM.exists(path + ".gz");
  if (pathWithGz || FILESYSTEM.exists(path)) {
    if (pathWithGz)
      path += ".gz";
    File file = FILESYSTEM.open(path, "r");
    server.streamFile(file, contentType);
    file.close();
    return true;
  }
  return false;
}

/*************************************************/

void setup()
{
  ESP.wdtDisable();

  IPAddress my_ip;
  uint8_t sta_up = 0;
  rst_info *resetInfo;
  resetInfo = ESP.getResetInfoPtr();
  int reset_reason = resetInfo->reason;

  msp_handler.markPacketFree();

  eeprom_storage.setup();

  /* Reset values */
  settings_rate = 1;
  settings_power = 4;
  settings_power_max = 8;
  settings_tlm = 7;
  settings_region = 255;
  settings_valid = 0;
#if CONFIG_HANDSET
  handset_num_switches = 6;
  handset_num_aux = 5;
  handset_mixer_ok = 0;
  handset_adjust_ok = 0;
#endif

#ifdef BUZZER_PIN
  pinMode(BUZZER_PIN, OUTPUT);
#endif
  beep(440, 30);

  //Serial.setRxBufferSize(256);
#ifdef INVERTED_SERIAL
  // inverted serial
  Serial.begin(SERIAL_BAUD, SERIAL_8N1, SERIAL_FULL, 1, true);
#else
  // non-inverted serial
  Serial.begin(SERIAL_BAUD);
#endif

  led_init();
  led_set(LED_INIT);
  batt_voltage_init();

#if (BOOT0_PIN == 2 || BOOT0_PIN == 0)
  reset_stm32_to_app_mode();
#endif

  FILESYSTEM.begin();
  //FILESYSTEM.format();

  wifi_station_set_hostname("elrs_tx");

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  if (WiFi.status() != WL_CONNECTED) {
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PSK, WIFI_CHANNEL);
  }
  uint32_t i = 0, led = 0;
#define TIMEOUT (WIFI_TIMEOUT * 10)
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(100);
    if (++i > TIMEOUT) {
      break;
    }
    if ((i % 10) == 0) {
      led_set(led ? LED_INIT : LED_OFF);
      led ^= 1;
    }
    ESP.wdtFeed();
  }
  sta_up = (WiFi.status() == WL_CONNECTED);

#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID WIFI_AP_SUFFIX)) {
    // AP found, connected
    sta_up = 1;
  }
#endif /* WIFI_MANAGER */

  if (!sta_up) {
    // WiFi not connected, Start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID WIFI_AP_SUFFIX, WIFI_AP_PSK, ESP_NOW_CHANNEL);
  }

  led_set(LED_WIFI_OK);

  espnow_init(ESP_NOW_CHANNEL);

  my_ip = (sta_up) ? WiFi.localIP() : WiFi.softAPIP();

