kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  if (mdns.begin("elrs_tx", my_ip)) {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }
  my_ipaddress_info_str = "My IP address = ";
  my_ipaddress_info_str += my_ip.toString();
  my_ipaddress_info_str += " (RST: ";
  my_ipaddress_info_str += reset_reason;
  my_ipaddress_info_str += ")";

#if defined(LATEST_COMMIT)
  my_ipaddress_info_str += "\nCurrent version (SHA): ";
  uint8_t commit_sha[] = {LATEST_COMMIT};
  for (uint8_t iter = 0; iter < sizeof(commit_sha); iter++) {
    my_ipaddress_info_str += String(commit_sha[iter], HEX);
  }
#endif // LATEST_COMMIT

  //Serial.print("Connect to http://elrs_tx.local or http://");
  //Serial.println(my_ip);

  server.on("/fs", handle_fs);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);
#if LOCAL_OTA
  server.on("/update_tst", HTTP_POST, // ESP OTA upgrade
    handleEspUpgradeFinalize, handleEspUpgrade);
#endif // LOCAL_OTA
  server.on("/upload", HTTP_POST, // STM32 OTA upgrade
    stm32_ota_handleFileUploadEnd, stm32_ota_handleFileUpload);
  server.onNotFound([]() {
    if (!handleFileRead(server.uri())) {
      // No matching file, respond with a 404 (Not Found) error
      //server.send(404, "text/plain", "404: Not Found");
      handle_recover();
    }
  });

  httpUpdater.setup(&server);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);

  beep(440, 30);
  delay(100);
  beep(440, 30);
}


int serialEvent()
{
  int temp, limit = 8;
  uint8_t inChar;
  while (Serial.available() && limit--) {
    temp = Serial.read();
    if (temp < 0)
      break;

    inChar = (uint8_t)temp;
    if (msp_handler.processReceivedByte(inChar)) {
      String info = "MSP received: ";
      // msp fully received
      mspPacket_t &msp_in = msp_handler.getPacket();
      if (msp_in.type == MSP_PACKET_V1_ELRS) {
        uint8_t * payload = (uint8_t*)msp_in.payload;
        switch (msp_in.function) {
          case ELRS_INT_MSP_PARAMS: {
            info += "ELRS params";
            settings_rate = payload[0];
            settings_tlm = payload[1];
            settings_power = payload[2];
            settings_power_max = payload[3];
            settings_region = payload[4];
            settings_valid = 1;

            if (settings_region != 255) {
              if (3 <= settings_region)
                led_set(LED_FREQ_2400);
              else
                led_set(LED_FREQ_900);
            }

            handleSettingDomain(NULL);
            handleSettingRate(NULL);
            handleSettingPower(NULL);
            handleSettingTlm(NULL);
            break;
          }
#if CONFIG_HANDSET
          case ELRS_HANDSET_CALIBRATE: {
            info += "CALIBRATE error";
            handleHandsetCalibrateResp(payload);
            break;
          }
          case ELRS_HANDSET_MIXER: {
            info += "MIXER config";
            handleHandsetMixerResp(payload);
            handset_mixer_ok = 1;
            break;
          }
          case ELRS_HANDSET_ADJUST: {
            info += "ADJUST config";
            handleHandsetAdjustResp(payload);
            handset_adjust_ok = 1;
            break;
          }
          case ELRS_HANDSET_TLM_LINK_STATS: {
            info += "LNK STAT telemetry";
            handleHandsetTlmLnkStats(payload);
            break;
          }
          case ELRS_HANDSET_TLM_BATTERY: {
            info += "BATTERY telemetry";
            handleHandsetTlmBattery(payload);
            break;
          }
          case ELRS_HANDSET_TLM_GPS: {
            info += "GPS telemetry";
            handleHandsetTlmGps(payload);
            break;
          }
#endif /* CONFIG_HANDSET */
          default:
            info += "UNKNOWN";
            break;
        };
      }

      websocket_send(info);
      espnow_send_msp(msp_in);

      msp_handler.markPacketFree();
    } else if (!msp_handler.mspOngoing()) {
      if (inChar == '\r') {
        continue;
      } else if (inChar == '\n' || 64 <= inputString.length()) {
        return 0;
      }
      if (isprint(inChar))
        inputString += (char)inChar;
    }

    //if (msp_handler.error())
    //  msp_handler.markPacketFree();
  }
  return -1;
}


void loop()
{
  ESP.wdtFeed();
  if (0 <= serialEvent()) {
    websocket_send(inputString);
    inputString = "";
  }

  server.handleClient();
  webSocket.loop();
  mdns.update();

  batt_voltage_measure();

  eeprom_storage.save();
}
